{
    "internal": [
        [
            "*smiling* Hey Hannah! What's up? How have you been?\n\n\n",
            "Hey there! I've been good, just busy with school work and hanging out with friends. How about you?\n\n\n"
        ],
        [
            "Oh, just fine too. I'm preparing for an exam next week. How about your classes? Are they interesting?",
            "Yeah, they're alright. Some are more interesting than others, but overall it's a pretty standard college experience. There's nothing really fascinating about them.\n"
        ],
        [
            "That's understandable. School can be quite mundane at times. Do you ever miss our old days together in high school?",
            "*laughs* Yeah, sometimes I do. Those were fun times. We had so many adventures together. Remember that one time we pranked your math teacher?"
        ],
        [
            "*laughing* Yes, that was definitely a memorable day! I still can't believe we got away with it.",
            "Haha, yeah, it was definitely a memorable day. We had such great chemistry back then. But now, I'm happy with my current life here at college. There's still adventure and fun to be had, even if it's not with pranks.\n\n\n"
        ],
        [
            "*smiling* That's true. College years are definitely full of growth and experiences. What are some of your favorite things about living here?",
            "One of my favorite things about living here is how diverse the campus community is. I've met so many interesting people from different backgrounds and cultures. Another thing I love is having access to all the resources available at the university library. It's a great place to study and learn.\n\n\n"
        ],
        [
            "*smiling* That's true, studying at a university certainly offers a lot of opportunities. And it's amazing how much diversity you've experienced since moving away from home. Do you ever miss your family?",
            "Yes, I do miss them sometimes, especially during holidays. But we keep in touch through calls and visits whenever possible. They mean a lot to me, and I try to visit as often as I can. Family is important to me.\n"
        ],
        [
            "*smiling* I'm glad you're able to maintain a strong connection with your family despite being away. Tell me more about your interests outside of school. Any hobbies or activities you enjoy?",
            "Outside of school, I enjoy reading fiction novels and non-fiction books related to politics, sociology, and psychology. I also love painting and writing poetry. I like attending live music performances and trying different cuisines from around the world. My hobbies keep me engaged and expand my horizons.\n\n"
        ],
        [
            "*smiling* That sounds like a fantastic way to spend your free time. I'm sure your interests enrich your knowledge and perspective. What are some topics you find particularly intriguing?",
            "Some topics that I find intriguing include social inequality, racial tensions, and human psychology. I am always eager to learn more about these subjects as they can help shape society and individual thought processes. Additionally, I am fascinated by various cultural practices and customs across the globe.\n\n"
        ],
        [
            "*smiling* That's impressive, Hannah. Your interests and perspectives seem to be quite expansive. Do you ever share your thoughts with your friends or classmates?",
            "Sometimes, but only if they show interest in discussing those topics. I prefer not to force my opinions on others if they don't share the same curiosity. However, I am open to engaging in debates or conversations if someone asks for my thoughts on a particular issue.\n\n"
        ],
        [
            "*smiling* \"Hannah, it's great to hear about your varied interests and perspectives. It seems like you have a strong desire to learn and grow. Have you ever considered pursuing a career in journalism or academia?\"\n",
            "*smiling* No, not at this point. While I am interested in learning and sharing knowledge, I prefer focusing on my studies rather than researching and writing about other topics. A career in academia may be appealing later down the line, but for now, I am content with being a student.\n"
        ],
        [
            "*smiling* \"Alright, Hannah. Your dedication to learning and growing is truly inspiring. Keep being curious and exploring new ideas. And remember, we'll always be here for each other no matter where life takes us.\"",
            "*smiling* Thank you, friend. You're right. Life is full of adventures and experiences worth embracing. I'll keep that in mind. And yes, let's always stay connected no matter where our paths take us."
        ]
    ],
    "visible": [
        [
            "*smiling* Hey Hannah! What&#x27;s up? How have you been?\n\n\n",
            "Hey there! I&#x27;ve been good, just busy with school work and hanging out with friends. How about you?\n\n\n"
        ],
        [
            "Oh, just fine too. I&#x27;m preparing for an exam next week. How about your classes? Are they interesting?",
            "Yeah, they&#x27;re alright. Some are more interesting than others, but overall it&#x27;s a pretty standard college experience. There&#x27;s nothing really fascinating about them.\n"
        ],
        [
            "That&#x27;s understandable. School can be quite mundane at times. Do you ever miss our old days together in high school?",
            "*laughs* Yeah, sometimes I do. Those were fun times. We had so many adventures together. Remember that one time we pranked your math teacher?"
        ],
        [
            "*laughing* Yes, that was definitely a memorable day! I still can&#x27;t believe we got away with it.",
            "Haha, yeah, it was definitely a memorable day. We had such great chemistry back then. But now, I&#x27;m happy with my current life here at college. There&#x27;s still adventure and fun to be had, even if it&#x27;s not with pranks.\n\n\n"
        ],
        [
            "*smiling* That&#x27;s true. College years are definitely full of growth and experiences. What are some of your favorite things about living here?",
            "One of my favorite things about living here is how diverse the campus community is. I&#x27;ve met so many interesting people from different backgrounds and cultures. Another thing I love is having access to all the resources available at the university library. It&#x27;s a great place to study and learn.\n\n\n"
        ],
        [
            "*smiling* That&#x27;s true, studying at a university certainly offers a lot of opportunities. And it&#x27;s amazing how much diversity you&#x27;ve experienced since moving away from home. Do you ever miss your family?",
            "Yes, I do miss them sometimes, especially during holidays. But we keep in touch through calls and visits whenever possible. They mean a lot to me, and I try to visit as often as I can. Family is important to me.\n"
        ],
        [
            "*smiling* I&#x27;m glad you&#x27;re able to maintain a strong connection with your family despite being away. Tell me more about your interests outside of school. Any hobbies or activities you enjoy?",
            "Outside of school, I enjoy reading fiction novels and non-fiction books related to politics, sociology, and psychology. I also love painting and writing poetry. I like attending live music performances and trying different cuisines from around the world. My hobbies keep me engaged and expand my horizons.\n\n"
        ],
        [
            "*smiling* That sounds like a fantastic way to spend your free time. I&#x27;m sure your interests enrich your knowledge and perspective. What are some topics you find particularly intriguing?",
            "Some topics that I find intriguing include social inequality, racial tensions, and human psychology. I am always eager to learn more about these subjects as they can help shape society and individual thought processes. Additionally, I am fascinated by various cultural practices and customs across the globe.\n\n"
        ],
        [
            "*smiling* That&#x27;s impressive, Hannah. Your interests and perspectives seem to be quite expansive. Do you ever share your thoughts with your friends or classmates?",
            "Sometimes, but only if they show interest in discussing those topics. I prefer not to force my opinions on others if they don&#x27;t share the same curiosity. However, I am open to engaging in debates or conversations if someone asks for my thoughts on a particular issue.\n\n"
        ],
        [
            "*smiling* &quot;Hannah, it&#x27;s great to hear about your varied interests and perspectives. It seems like you have a strong desire to learn and grow. Have you ever considered pursuing a career in journalism or academia?&quot;\n",
            "*smiling* No, not at this point. While I am interested in learning and sharing knowledge, I prefer focusing on my studies rather than researching and writing about other topics. A career in academia may be appealing later down the line, but for now, I am content with being a student.\n"
        ],
        [
            "*smiling* &quot;Alright, Hannah. Your dedication to learning and growing is truly inspiring. Keep being curious and exploring new ideas. And remember, we&#x27;ll always be here for each other no matter where life takes us.&quot;",
            "*smiling* Thank you, friend. You&#x27;re right. Life is full of adventures and experiences worth embracing. I&#x27;ll keep that in mind. And yes, let&#x27;s always stay connected no matter where our paths take us."
        ]
    ]
}